export const newsList = [
    {
        date: '2026.04.19',
        type: 'youtube',
        title: '【Unity】鉄板の穴を選択する#6【たこ焼き屋さん】を投稿しました。',
        description: 'クリック時に取得したマウスカーソルの位置座標に応じて、たこ焼き機のどの穴を選択しているか判別する仕組みを実装しています。',
        url: '#'
    },

    {
        date: '2026.01.21',
        type: 'youtube',
        title: '【Unity】クリック時の位置座標を取得する#5【たこ焼き屋さん】を投稿しました。',
        description: 'クリック時にマウスカーソルの位置座標を取得する方法について解説しています。',
        url: '#'
    },

    {
        date: '2025.12.24',
        type: 'youtube',
        title: '【Unity】具材を追加する#4【たこ焼き屋さん】を投稿しました。',
        description: 'たこ焼きに具材を追加する方法について解説しています。何の具材を追加したかによって、たこ焼きの見た目が変化する仕組みを実装しています。',
        url: '#'
    },

    {
        date: '2025.12.08',
        type: 'youtube',
        title: '【Unity】操作を選択する#3【たこ焼き屋さん】を投稿しました。',
        description: '操作を切り替える方法について解説しています。プレイヤーが異なる操作を選択できるようにする仕組みを実装しています。',
        url: '#'
    },

    {
        date: '2025.12.04',
        type: 'youtube',
        title: '【Unity】状態を遷移する#2【たこ焼き屋さん】を投稿しました。',
        description: '様々な状態の切り替えを管理する方法について解説しています。時間経過で状態が遷移していく仕組みを実装しています。',
        url: '#'
    },

    {
        date: '2025.12.02',
        type: 'youtube',
        title: '【Unity】クリックを検知する#1【たこ焼き屋さん】を投稿しました。',
        description: '新作ゲーム「たこ焼き屋さん」の開発過程を紹介する動画シリーズの第一弾です。Unityを使用して、クリックイベントの検知方法について解説しています。',
        url: '#'
    }
];